In [3]:
import pandas as pd

In [6]:
df = pd.read_csv('C:/Users/power/Downloads/heights.csv')
df.head()

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [11]:
df.height.quantile(0.95)

9.689999999999998

In [15]:
max_thresold = df['height'].quantile(0.94)
max_thresold

8.72799999999999

In [17]:
min_thresold = df['height'].quantile(0.05)
min_thresold

3.6050000000000004

In [19]:
df[df['height'] < min_thresold]

      name  height
12  yoseph     1.2

In [20]:
df[(df['height'] < max_thresold) & (df['height'] > min_thresold)]

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

In [21]:
df2 = df[(df['height'] < max_thresold) & (df['height'] > min_thresold)]
df2

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5